{
    "sub_tasks": [
        {
            "bullet_points": [
                "Focus on generating diverse and creative ideas.",
                "Provide a brief description for each idea."
            ],
            "sub_task": "Generate 5 new research project ideas related to the problem of interest.",
            "sub_task_agent": "idea_maker"
        },
        {
            "bullet_points": [
                "Evaluate the feasibility and originality of each idea.",
                "Evaluate each idea's academic significance.",
                "Identify any weaknesses or limitations in the ideas.",
                "Consider potential methodological challenges specific to the problem of interest.",
                "Suggest improvements or modifications for each idea."
            ],
            "sub_task": "Critique the 5 research project ideas generated in Step 1.",
            "sub_task_agent": "idea_hater"
        },
        {
            "bullet_points": [
                "Choose the 2 most promising ideas from the original 5.",
                "Address the critiques and suggestions provided by idea_hater.",
                "Provide more detailed explanations (at least 3-4 sentences) for each of the two selected ideas.",
                "Explicitly address how the improvements respond to each specific critique raised by idea_hater."
            ],
            "sub_task": "Select and improve 2 out of the 5 research project ideas based on the critiques from Step 2.",
            "sub_task_agent": "idea_maker"
        },
        {
            "bullet_points": [
                "Assess the improvements made to the ideas.",
                "Provide additional feedback on how to further refine the ideas.",
                "Assess the potential impact of each idea on current research.",
                "Identify any remaining conceptual ambiguities or logical inconsistencies in the improved ideas."
            ],
            "sub_task": "Critique the 2 improved research project ideas from Step 3.",
            "sub_task_agent": "idea_hater"
        },
        {
            "bullet_points": [
                "Consider the critiques and feedback from Step 4.",
                "Justify your selection with specific references to the strengths identified in previous steps.",
                "Outline 2-3 key research questions that would guide this project.",
                "Choose the idea with the most potential for impactful research."
            ],
            "sub_task": "Select the best research project idea out of the 2 improved ideas.",
            "sub_task_agent": "idea_maker"
        },
        {
            "bullet_points": [
                "Create a concise and compelling scientific paper title.",
                "Ensure the title reflects both philosophers' contributions to the research concept.",
                "Write a 5-sentence description summarizing the research project."
            ],
            "sub_task": "Report the best research project idea in the form of a scientific paper title with a 5-sentence description.",
            "sub_task_agent": "idea_maker"
        }
    ]
}